In [1]:
import pandas as pd

In [2]:
# DataFrame

dict1 = {'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv','Mittal','Archana'],
        'Marks':[98,89,99,87,90,83,99],
        'Gender':['Male','Female','Female','Male','Male','Female','Female']}

df1 =  pd.DataFrame(dict1)

In [3]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

1. Display Top 3 Rows of dataset

In [4]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [6]:
# 2.Display Last 3 rows of dataset

df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
# 3. Find shape of our Dataset (Number of rows and columns)
# shape is not method it is attribute of pandas dataframe
df1.shape

(7, 3)

In [9]:
print('Number  of Rows',df1.shape[0])
print('Number of columns', df1.shape[1])

Number  of Rows 7
Number of columns 3

In [10]:
# 4. Get Information About our dataset

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [12]:
# 5. Check null values in the datset
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [14]:
# 6. Get Overall stastistics about the dataframe

df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [16]:
# 7. Find unique values from the gender column

df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [17]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [18]:
# 8. Find the number of unique values from gender column

df1['Gender'].nunique()

2

In [19]:
# 9. Display count of unique values in gender column
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [20]:
# 10. Find total number of students having marks between 90 to 100 (inclusive) using between method

df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [21]:
df1['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [22]:
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [23]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [28]:
# Without using between method
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [31]:
# Using between method

sum(df1['Marks'].between(90,100))

4

In [32]:
# 11. Find Average Marks

df1['Marks'].mean()

92.14285714285714

In [33]:
# 12. Apply Methods

def marks(x):
    return x/2

In [34]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [35]:
df1['Half_Marks'] = df1['Marks'].apply(marks)

In [36]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [37]:
# lambda function

df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [38]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [39]:
# 13. Use Map Funstion

df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [42]:
df1['Male_Female'] = df1['Gender'].map({'Male':1,'Female':0})

In [43]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [44]:
# 14. Drop the column
 
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [46]:
df1.drop('Half_Marks', axis=1)

      Name  Marks  Gender  Male_Female
0  Priyang     98    Male            1
1   Aadhya     89  Female            0
2   Krisha     99  Female            0
3   Vedant     87    Male            1
4   Parshv     90    Male            1
5   Mittal     83  Female            0
6  Archana     99  Female            0

In [47]:
# 15. Print Name of the columns

df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_Marks', 'Male_Female'], dtype='object')

In [48]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [50]:
#16. Sort the dataframe as per the marks column

df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [53]:
df1.sort_values(by = ['Marks','Gender'])

      Name  Marks  Gender  Half_Marks  Male_Female
5   Mittal     83  Female        41.5            0
3   Vedant     87    Male        43.5            1
1   Aadhya     89  Female        44.5            0
4   Parshv     90    Male        45.0            1
0  Priyang     98    Male        49.0            1
2   Krisha     99  Female        49.5            0
6  Archana     99  Female        49.5            0

In [54]:
# 17. Display Name and Marks Of the Female students

df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [58]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [61]:
# Easy method

df1[df1['Gender'].isin(['Female'])] [['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99